{"pageProps":{"id":1,"title":"Secure your business website for free","name":"secure-your-business-website-for-free","date":1510488000,"content":"<p>If your business website offers an intranet area protected by authentication or exchanges sensible data with the user,\nthen it is critical for you to serve it over <em>https</em> protocol rather than plain <em>http</em>. The reason is that in <em>https</em>\nthe communication between the client and server is encrypted. The <em>https</em> protocol also ensures the user about the\nauthenticity of the website, so they won&#39;t be afraid of who they are sending their credentials to.</p>\n<p>To secure your business website in <em>https</em>, you need to have an SSL certificate emitted by a certification authority\n(CA). This is a trusted third-party entity that will ensure the user about the authenticity of your website.</p>\n<p>Once the CA has released the certificate, you need to set up your webserver adding the entry for the <em>https</em> connection.\nIt is also important to edit the configuration for the plain <em>http</em> connection by setting up a redirect to the secure\nprotocol. In this way, when a user tries to visit your website over <em>http</em> they will be immediately redirected over\n<em>https</em>.</p>\n<p>The emission of a trusted SSL certificate has a cost that depends on the type of the certificate. This cost includes\nthe CA taxes and the service of the certificate provider. But there is now a way to have a valid and fully trusted SSL\ncertificate for free.</p>\n<p><em>Let&#39;s Encrypt</em> is a non-profit Certification Authority that emits SSL certificates for free. It also offers a command\nline tool, <em>certbot</em>, for automatically emitting and renewing the certificates that you need for your websites.</p>\n<p>This completely cuts off all the recurring costs for securing your business website and it also simplifies the process\nof emitting, installing and renewing the SSL certificates.</p>\n","formattedDate":"November 12, 2017"},"__N_SSG":true}