{"pageProps":{"id":5,"title":"What does it really mean writing code?","name":"what-does-it-really-mean-writing-code","date":1587124800,"content":"<p>If I would ask you what a programmer does, your answer would probably be something like\n<em>&quot;a programmer writes computer applications&quot;</em>. A more detailed definition is that a programmer designs algorithms and\ntranslate them into code that can be executed by a computer. So a programmer starts their job by thinking about the\nsteps to perform to produce the expected result. For instance, it may be something like:\n<em>&quot;when this function runs, it will receive the list of products the user wants to buy, so I have to check whether the\nproducts are still available, then compute the total amount to be paid and create a new order in the database for the\ncurrent user&quot;</em>. The algorithm is defined. At this point the programmer will jump to their keyboard, open a new file\nand start coding the algorithm that lives in their head. After a few rounds of testing the functions does what it\nshould do. Perfect, you might think. Mission accomplished.</p>\n<p>Wrong!</p>\n<p>If this would be your approach you would end up with some code that (probably) works, but that is terribly hard to\nread. As soon as you have written it, the code is fresh in your mind and it will be easy for you to read and understand.\nIn a month&#39;s time, it will take you 10 or 15 minutes to recall why you did that particular step. In 6 months&#39; time it\nwill cost you much more time. And we are only considering yourself as the programmer who wrote the code. If you go on\nvacation or start working for a different company, one of your colleagues will pick up your work and will be very\nfrustrated trying to understand what that variable means.</p>\n<p>This leads us to an important aspect of software products that is usually overlooked: <strong>maintenance cost</strong>. If we consider\nthe overall cost of a software product, from when we start gathering the requirements to when we dismiss it, the\nmaintenance takes more than half of the total cost (Massimo Pica, <em>Systems Lifecycle Cost-Effectiveness</em>, 2016). But\nthere is a more important fact that will give you a better idea of maintenance costs. If fixing a bug found while\ngathering the requirements costs you $100, fixing it during the QA testing phase will cost you $1,500 and $10,000 while\nthe product is in production (from a 2003 study by the Department of Commerce’s National Institute of Standards\nand Technology).</p>\n<p>Those are concrete costs that companies pay. But there is another one which is less visible: developer happiness.\nI never met anybody that said <em>&quot;Look at that messy procedure. I look forward to diving into it&quot;</em>. Working on code that\nis hard to read and understand is frustrating and will reduce the quality perceived by the developers and their trust\nin it. That&#39;s why I love this quote:</p>\n<blockquote class=\"blockquote\">\n  <p class=\"mb-0\">\n    Always write code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you\n    live.\n  </p>\n</blockquote>\n\n<p>For this reason, I believe that being a programmer does not only mean writing code that works. Ideally, you want\nsomeone who isn&#39;t a programmer to read your code and to understand what it does. This may sound impossible, but that&#39;s\nexactly the goal you should have in your mind when coding. Whenever you have to choose a name for a variable or a\nfunction then ask yourself: <em>&quot;Would the man on the street understand what the code does&quot;</em>? At the end of the day, your\ncode is mostly composed of words you chose to use. Choose significative words. Whenever you feel the need to add a\ncomment try to refactor your code so that it will communicate the message that you would have written in the comment\ninstead. Prefer speaking names rather than meaningless or ambiguous abbreviations or worst, single-letter names!</p>\n<p>In the long run, writing maintainable code is the winning choice. The implementation will cost slightly more, but\nfinding bugs and introducing new functionalities will cost less and it won&#39;t be painful for developers to work on it.\nThere are many techniques your team can adopt to increase code maintainability, like <em>test-driven development</em>\nand <em>peer code reviews</em>, but those are broad topics that deserve dedicated space.</p>\n","formattedDate":"April 17, 2020"},"__N_SSG":true}