{"pageProps":{"id":6,"title":"Go: why you don't need GoMock","name":"go-why-you-dont-need-go-mock","date":1620895980,"content":"<p>GoMock is an official command-line tool for generating mocks to use in unit tests. It&#39;s very powerful, but it still requires you to apply some changes to your code, and so very often you don&#39;t need it. Let&#39;s see what GoMock does.</p>\n<h2 id=\"how-gomock-works\">How GoMock works</h2>\n<p>Firstly, you define an interface for what you want to mock. For instance, if you want to mock the HTTP client you will define the following interface.</p>\n<pre><code class=\"language-go\">type HTTPClient interface {\n    Do func(request *http.Request) (*http.Response, error)\n}\n</code></pre>\n<p>Then you define a concrete implementation to use at runtime, for instance <code>http.DefaultClient</code>. GoMock will create for you the mocked instance to use during tests.\nNow your real function, the one you want to test, needs access to an <code>HTTPClient</code>, whether it is mocked or not. How are we going to pass it? You can add an argument to the real function, using a default value if <code>nil</code> is passed.</p>\n<pre><code class=\"language-go\">func FetchProducts(category string, httpClient *HTTPClient) {\n    if httpClient == nil {\n        httpClient = http.DefaultClient\n    }\n}\n</code></pre>\n<p>In this case, our concrete implementation comes from the standard library. But you could have to define your own.</p>\n<p>Another option for passing an <code>HTTPClient</code> to our concrete function is to define a package-global variable and initialize it in the <code>init</code> function.</p>\n<pre><code class=\"language-go\">var httpClient HTTPClient\n\nfunc init() {\n    httpClient := http.DefaultClient\n}\n\nfunc FetchProducts(category string) {\n    ....\n    response, err := httpClient.Do(request)\n    ....\n}\n</code></pre>\n<p>In this way, our <code>FetchProducts</code> doesn&#39;t need an extra parameter so I find this solution cleaner. On the other hand, some developers like to define a different package name when testing. In that case, you&#39;ll have to export this package-global variable (making it uppercase: <code>var HttpClientInstance HTTPClient</code>). This makes it a little bit less clean because your package should export only what&#39;s needed and in this case, it&#39;s exporting a member that&#39;s needed only for testing. Anyway, it&#39;s up to you to decide what option is better in your case. Let&#39;s move on.</p>\n<p>Now you can mock the <code>HTTPClient</code> with GoMock. Open a terminal, <a href=\"https://github.com/golang/mock#installation\">install GoMock</a> if you haven&#39;t done it already and give the following command to generate the mock <code>HTTPClient</code>.</p>\n<pre><code class=\"language-shell\">mockgen -destination=mocks/mock_http_client.go -package=mocks github.com/EgidioCaprino/mymodule/mypackage HTTPClient\n</code></pre>\n<p>Some details:</p>\n<ul>\n<li><code>github.com/EgidioCaprino/mymodule/mypackage</code> is the package where GoMock should look for the things your want to mock,</li>\n<li><code>HttpClient</code> is the thing you want to mock,</li>\n<li><code>-destination=mocks/mock_http_client.go</code> is the file where you want GoMock to write the mocked implementation,</li>\n<li><code>-package=mocks</code> is package name used in the new file.</li>\n</ul>\n<p>You can use the auto-generated mock in your test in this way.</p>\n<pre><code class=\"language-go\">func TestFetchProducts(t *testing.T) {\n    // Create a mock request and a mock response\n    ....\n\n    controller := gomock.NewController(t)\n    defer controller.Finish()\n    mockHTTPClient := NewMockHTTPClient(controller)\n    mockHTTPClient\n        .EXPECT()\n        .Do(mockRequest)\n        .Return(mockResponse)\n    FetchProducts(mockHTTPClient)\n}\n</code></pre>\n<h2 id=\"how-to-do-it-without-gomock\">How to do it without GoMock</h2>\n<p>So GoMock creates an implementation of your service where you can do assertions like <em>&quot;it&#39;s been called 1 time&quot;</em>, <em>&quot;with these arguments&quot;</em> and <em>&quot;provide this value when called&quot;</em>. Everything it&#39;s awesome, but the main point is that you still need to update your code so it can switch between concrete and mock. So, if you have to make your code less clean and don&#39;t have particular needs (explained later), why you can&#39;t simply define a mocked value at test-runtime, depending on your test case?</p>\n<p>You can define an interface as before, but I think that often it&#39;s easier to just define a function, especially if you prefer functional programming. Let&#39;s try it.</p>\n<pre><code class=\"language-go\">var DoHTTPRequest func(request *http.Request) (*http.Response, error)\n</code></pre>\n<p>This is just the definition of a function that makes HTTP requests. You could make it package-private if you want, depending on whether you&#39;re going to use a different package name in your tests or not.</p>\n<p>Then, as before, you can add an extra argument to your function or define a package-global variable and initialize it in the <code>init</code> function.</p>\n<pre><code class=\"language-go\">// Extra argument version\nfunc FetchProducts(category string, doHTTPRequest DoHTTPRequest) {\n    ...\n    response, err := doHTTPRequest(request)\n    ....\n}\n\n// Package-global variable version\nvar doHTTPRequest DoHTTPRequest\n\ninit() {\n    doHTTPRequest := http.DefaultClient.Do\n}\n\nfunc FetchProducts(category string) {\n    ...\n    response, err := doHTTPRequest(request)\n    ....\n}\n</code></pre>\n<p><code>FetchProducts</code> works as before. Now, in your tests, you simply define an inline function before invoking <code>FetchProducts</code>.</p>\n<pre><code class=\"language-go\">func TestFetchProducts(t *testing.T) {\n  // Control flag to assert the mocked function is called\n  doHTTPRequestInvoked := false\n\n  // Update package-global variable; you may need to pass doHTTPRequest to FetchProducts otherwise\n  doHTTPRequest = func(request *http.Request) (*http.Response, error) {     \n    doHTTPRequestInvoked = true     \n    \n    // Check whether the request is correct and provide a mock response\n    ....\n  }\n  \n  products, err := FetchProducts()\n  assert.True(t, doHTTPRequestInvoked)\n  \n  // Other assertions\n  ....\n}\n</code></pre>\n<p>In each test case you can define different implementations, depending on the scenario you want to test. For instance, do you want to test a network error?</p>\n<pre><code class=\"language-go\">func TestFetchProducts(t *testing.T) {\n   doHTTPRequestInvoked := false\n\n   doHTTPRequest = func(request *http.Request) (*http.Response, error) {\n      doHTTPRequestInvoked = true\n\n      return nil, errors.New(&quot;network error&quot;)\n   }\n\n   _, err = FetchProducts()\n\n   assert.True(t, doHTTPRequestInvoked)\n   assert.NotNil(err)\n}\n</code></pre>\n<p>Or maybe you want to test a successful request with a particular response body?</p>\n<pre><code class=\"language-go\">func TestFetchProducts(t *testing.T) {\n    doHTTPRequestInvoked := false\n    \n    doHTTPRequest = func(request *http.Request) (*http.Response, error) {\n        doHTTPRequestInvoked = true\n    \n        body := &quot;response body in here&quot;\n        response := http.Response{\n            StatusCode: http.StatusOK,\n            Body:       ioutil.NopCloser(strings.NewReader(body)),\n        }\n        return &amp;response, nil\n    }\n    \n    products, _ = FetchProducts()\n    \n    assert.True(t, doHTTPRequestInvoked)\n    \n    // Check FetchProducts handles correctly the response\n    ....\n}\n</code></pre>\n<p>I feel in most cases this is the simplest solution, but there are some limitations. By default, the <code>go test</code> command may run tests for different packages in parallel as well. How this affects our mocks? It depends on your mocking strategy.</p>\n<p>If you&#39;re adding an extra argument to the function you want to test, you&#39;ll be thread-safe in all cases. This is because in your tests you&#39;re creating a different mock for each test case.</p>\n<p>But what if you&#39;re opting for the strategy with a package-global variable? If this variable is unexported, your code will be thread-safe as long as you&#39;re not running tests in parallel within a single package, which is the default behavior (check out the <code>-parallel n</code> argument of <code>go test</code>). Otherwise, if you&#39;re exporting that variable, <em>your code won&#39;t be thread-safe</em> in case you&#39;re mocking that same variable in tests from different packages. That&#39;s because each thread will write to the same variable at the same time.</p>\n","formattedDate":"May 13, 2021"},"__N_SSG":true}