{"pageProps":{"id":7,"title":"Extend a Docker image on the fly, without defining a new image","name":"extend-a-docker-image-on-the-fly-without-defining-a-new-image","date":1638454534,"content":"<p>If you want to use a particular Docker image but you need to apply some changes to it, the correct way to go is to extend that image and build your own on top of it. So basically, you will have to create a new <code>Dockerfile</code> with <code>FROM: alpine</code> or whatever is your source image, followed by a set of instructions where you apply the customization you need in your image. For instance, you could install your application executable and all the dependencies it needs.</p>\n<h2 id=\"but-what-if-you-dont-want-to-create-a-new-docker-image\">But what if you don&#39;t want to create a new Docker image?</h2>\n<p>In some situations, it doesn&#39;t make much sense to extend an existing image. For instance, for a personal use application (<strong>not a production one</strong>) that you don&#39;t want to maintain, where all the customization you need is installing one or two additional packages. In that case, it would be easier to just install the packages and then run the command the image is meant to run by default. But first, let&#39;s give a look at the <code>docker run</code> command.</p>\n<p>This is what the official documentation tells us:</p>\n<pre><code>docker run [OPTIONS] IMAGE[:TAG|@DIGEST] [COMMAND] [ARG...]\n</code></pre>\n<p>The <code>COMMAND</code> option allows us to specify an optional command to run when the container starts. For instance, if we want to spawn a new container and get a shell for testing, we could do the following.</p>\n<pre><code>docker run -it --rm alpine sh\n</code></pre>\n<p>It will spawn a new container in interactive mode and once it&#39;s up it will run the <code>sh</code> command. So this is a good way to test the commands we want the container to run. Once we know the commands, we could add them to a script like this.</p>\n<pre><code>#/usr/bin/env sh\n\napk add s-nail\nsh\n</code></pre>\n<p>Let&#39;s name it <code>start.sh</code> and don&#39;t forget to make this script executable: <code>chmod +x start.sh</code>. Also, remember to replace the Shebang line <code>#/usr/bin/env sh</code> with the most suitable one for your image. For instance, if you&#39;re not using Apline but another image with Bash, you may want to replace it with <code>#/usr/bin/env bash</code>.</p>\n<p>So now we could mount this script and pass its path to the <code>COMMAND</code> option when running <code>docker run</code>.</p>\n<pre><code>docker run -it -v &quot;$(pwd)/start.sh&quot;:/start.sh alpine /start.sh\n</code></pre>\n<p>Now we get a shell, as before, but before that the container will install S-nail. We&#39;re almost there.</p>\n<p>Probably we don&#39;t want to get an interactive shell, but rather execute the default command the image was meant to run. For instance, if that container is a Nextcloud instance, we want it to start Nextcloud when we do <code>docker run</code>. But what&#39;s the command for that?</p>\n<p>In general, when a container starts, it will run the <code>CMD</code> specified in the <code>Dockerfile</code>. The most accurate way to find it is</p>\n<ul>\n<li>to go to <a href=\"https://hub.docker.com/\">Docker Hub</a>,</li>\n<li>search for your image,</li>\n<li>open the Tags tab,</li>\n<li>select the exact version you want to use, or <code>latest</code> otherwise,</li>\n<li>on the left, search for the latest occurrence of the <code>CMD</code> definition.</li>\n</ul>\n<p>That&#39;s the command you want to append to your <code>start.sh</code> script instead of the <code>sh</code> one. For instance, for <a href=\"https://hub.docker.com/layers/nextcloud/library/nextcloud/stable-fpm-alpine/images/sha256-5aded1c55b126768ed6f54c5ff30b4622432198905b47f12c052d87d9cb6131e?context=explore\">this Nextcloud image</a>, the command the container will run by default is <code>php-fpm</code>.</p>\n","formattedDate":"December 2, 2021"},"__N_SSG":true}